---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CoarseScaleFillPatternIdParam
source: html/3d399dee-e13d-b3f5-7f8c-32ba0910b5d5.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CoarseScaleFillPatternIdParam Property

"Coarse Scale Fill Pattern"

## Syntax (C#)
```csharp
public static ForgeTypeId CoarseScaleFillPatternIdParam { get; }
```